// 1. Вивести в консоль квадрати чисел від 1 до 10 (за допомогою циклу)

// 2. Написати код, який запитує через prompt пароль користувача, порівнює його з тим, який у неї збережений (захардкоджений у константі). Якщо пароль співпав - виводить на консоль “Ви успішно увійшли в систему”, якщо ні - продовжує запитувати пароль і перевіряти, поки не введуть правильно (за допомогою вічного цикла)

// 3. Обчислити сумму чисел від 1 до 100 і вивести її в консоль

// 4. Вивести числа від 10 до 50, які кратні 5.

// 5. Намалювати в консолі символами “*” трикутник заданого користувачем розміру

// *
// **
// ***
// ****
// *****
// ******

// 6. Намалювати пустий квадрат з діагоналлю (зліва зверху - до права низу)

const size = Number(prompt("Enter size of the square:"));

for (let i = 0; i < size; i++) {
  let row = "";
  for (let j = 0; j < size; j++) {
    if (i === 0 || i === size - 1 || j === 0 || j === size - 1 || i === j) {
      row += "*";
    } else {
      row += " ";
    }
  }
  console.log(row);
}

// 7. Задачка з *: Зробити квадрат зі зворотньою діагоналлю (з правого верхнього до лівого нижнього)
