// 1. Вивести в консоль квадрати чисел від 1 до 10 (за допомогою циклу)

// 2. Написати код, який запитує через prompt пароль користувача, порівнює його з тим, який у неї збережений (захардкоджений у константі). Якщо пароль співпав - виводить на консоль “Ви успішно увійшли в систему”, якщо ні - продовжує запитувати пароль і перевіряти, поки не введуть правильно (за допомогою вічного цикла)

// 3. Обчислити сумму чисел від 1 до 100 і вивести її в консоль

// 4. Вивести числа від 10 до 50, які кратні 5.

for (let i = 10; i <= 50; i++) {
  if (i % 5 === 0) {
    console.log(i);
  }
}

// 5. Намалювати в консолі символами “*” трикутник заданого користувачем розміру

// *
// **
// ***
// ****
// *****
// ******

// 6. Намалювати пустий квадрат з діагоналлю (зліва зверху - до права низу)

// 7. Задачка з *: Зробити квадрат зі зворотньою діагоналлю (з правого верхнього до лівого нижнього)
